
** Create new disk image
We mount the partitions of the image and modify them in place. From [[https://unix.stackexchange.com/a/316410][this StackExchange answer]] we find a mechanism for determining how to determine the correct parameters. First decompress the `.zip` file using something like `unzip` and then determine the partition map of the resulting disk image.

On a Linux box:
#+BEGIN_SRC bash
  fdisk -lu ~/Downloads/2020-08-20-raspios-buster-arm64.img
#+END_SRC
#+RESULTS:
:RESULTS:
Device                                         Boot  Start     End Sectors  Size Id Type
Downloads/2020-08-20-raspios-buster-arm64.img1        8192  532479  524288  256M  c W95 FAT32 (LBA)
Downloads/2020-08-20-raspios-buster-arm64.img2      532480 7380991 6848512  3.3G 83 Linux
:END:

On this image, the Start offsets are 8192 and 532480 for the boot and root partitions, respectively. The sector size is 512 bytes, and this gives us the extra information we need to determine how many bytes into the image each partition is located.

** resize root partition (also ramfs job)
#+BEGIN_SRC bash
  parted -m /dev/mmcblk0 unit s print
  parted -m /dev/mmcblk0 unit s rm 3
  parted -m /dev/mmcblk0 unit s resize 2 124735487

  /sbin/cryptsetup luksOpen /dev/mmcblk0p2 rootfs

  lvm
  pvresize /dev/mapper/rootfs
  lvextend -l +100%FREE /dev/vg0/lvroot
  vgchange -a y

  resize2fs -f /dev/mapper/vg0-lvroot

  vgchange -a n
#+END_SRC
#+RESULTS:
:RESULTS:
BYT;
/dev/mmcblk0:124735488s:sd/mmc:512:512:msdos:SD SN64G:;
1:8192s:532479s:524288s:fat32::lba;
2:532480s:18317311s:17784832s:::;
3:18317312s:124735487s:106418176s:ext4::;
:END:




